app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-03-16 15:32:18.066972"], ["id", 1]]
---
  def update
    set_article
    @article.update(title: params[:article][:title], description: params[:article][:description])